<HTML>
<TITLE> РўР°Р±Р»РёС†Р° СѓРјРЅРѕР¶РµРЅРёСЏ </TITLE>
<BODY>
<TABLE border=1>
<?php
for ($i=1; $i<=10; $i++) { // Р·Р°РїСѓСЃРєР°РµРј РїРµСЂРІС‹Р№ С†РёРєР»
 echo ("<tr>"); // РЅР°С‡Р°Р»Рѕ СЃС‚СЂРѕРєРё С‚Р°Р±Р»РёС†С‹
 for ($k=1; $k<=10; $k++) { // Р·Р°РїСѓСЃРєР°РµРј РІС‚РѕСЂРѕР№ С†РёРєР»
 echo ("<td align=center>"); // РѕС‚РєСЂС‹РІР°РµРј СЏС‡РµР№РєСѓ С‚Р°Р±Р»РёС†С‹
 $p=$i*$k; // РЅР°С…РѕРґРёРј РїСЂРѕРёР·РІРµРґРµРЅРёРµ РґРІСѓС… С‡РёСЃРµР» Рё...
 echo ($p); // РІС‹РІРѕРґРёРј РµРіРѕ,
 echo ("</td>"); // Р° РїРѕС‚РѕРј Р·Р°РєСЂС‹РІР°РµРј СЏС‡РµР№РєСѓ
 }
 echo ("</tr>"); // РєРѕРЅРµС† СЃС‚СЂРѕРєРё С‚Р°Р±Р»РёС†С‹
}
?>
</TABLE>
</BODY>
</HTML>